"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 1, \"word_counts\": \"{\\\"the\\\": 5653, \\\"national\\\": 9, \\\"curriculum\\\": 1, \\\"framework\\\": 2, \\\"ncf\\\": 2, \\\"2005\\\": 1, \\\"recommends\\\": 1, \\\"that\\\": 1214, \\\"children\\\\u2019s\\\": 3, \\\"life\\\": 136, \\\"at\\\": 399, \\\"school\\\": 14, \\\"must\\\": 85, \\\"be\\\": 430, \\\"linked\\\": 5, \\\"to\\\": 2580, \\\"their\\\": 267, \\\"outside\\\": 8, \\\"this\\\": 562, \\\"principle\\\": 4, \\\"marks\\\": 2, \\\"a\\\": 1864, \\\"departure\\\": 20, \\\"from\\\": 531, \\\"legacy\\\": 1, \\\"of\\\": 3551, \\\"bookish\\\": 1, \\\"learning\\\": 18, \\\"which\\\": 644, \\\"continues\\\": 2, \\\"shape\\\": 8, \\\"our\\\": 139, \\\"system\\\": 23, \\\"and\\\": 3697, \\\"causes\\\": 6, \\\"gap\\\": 1, \\\"between\\\": 36, \\\"home\\\": 31, \\\"community\\\": 5, \\\"syllabi\\\": 1, \\\"textbooks\\\": 4, \\\"developed\\\": 8, \\\"on\\\": 569, \\\"basis\\\": 2, \\\"signify\\\": 1, \\\"an\\\": 272, \\\"attempt\\\": 13, \\\"implement\\\": 1, \\\"basic\\\": 1, \\\"idea\\\": 40, \\\"they\\\": 281, \\\"also\\\": 97, \\\"discourage\\\": 1, \\\"rote\\\": 1, \\\"maintenance\\\": 3, \\\"sharp\\\": 2, \\\"boundaries\\\": 5, \\\"different\\\": 34, \\\"subject\\\": 22, \\\"areas\\\": 4, \\\"we\\\": 237, \\\"hope\\\": 53, \\\"these\\\": 214, \\\"measures\\\": 5, \\\"will\\\": 240, \\\"take\\\": 39, \\\"us\\\": 79, \\\"significantly\\\": 1, \\\"further\\\": 7, \\\"in\\\": 1670, \\\"direction\\\": 8, \\\"child\\\": 36, \\\"centred\\\": 2, \\\"education\\\": 13, \\\"outlined\\\": 1, \\\"policy\\\": 3, \\\"1986\\\": 1, \\\"success\\\": 13, \\\"effort\\\": 7, \\\"depends\\\": 2, \\\"steps\\\": 21, \\\"principals\\\": 2, \\\"teachers\\\": 5, \\\"encourage\\\": 4, \\\"children\\\": 26, \\\"reflect\\\": 18, \\\"own\\\": 117, \\\"pursue\\\": 18, \\\"imaginative\\\": 2, \\\"activities\\\": 6, \\\"questions\\\": 15, \\\"recognise\\\": 3, \\\"given\\\": 20, \\\"space\\\": 5, \\\"time\\\": 128, \\\"freedom\\\": 4, \\\"generate\\\": 1, \\\"new\\\": 81, \\\"knowledge\\\": 39, \\\"by\\\": 593, \\\"engaging\\\": 3, \\\"with\\\": 857, \\\"information\\\": 23, \\\"passed\\\": 71, \\\"them\\\": 179, \\\"adults\\\": 1, \\\"treating\\\": 2, \\\"prescribed\\\": 2, \\\"textbook\\\": 8, \\\"as\\\": 693, \\\"sole\\\": 5, \\\"examination\\\": 4, \\\"is\\\": 504, \\\"one\\\": 268, \\\"key\\\": 2, \\\"reasons\\\": 3, \\\"why\\\": 44, \\\"other\\\": 130, \\\"resources\\\": 6, \\\"sites\\\": 3, \\\"are\\\": 280, \\\"ignored\\\": 1, \\\"inculcating\\\": 1, \\\"creativity\\\": 1, \\\"initiative\\\": 1, \\\"possible\\\": 15, \\\"if\\\": 237, \\\"perceive\\\": 9, \\\"treat\\\": 1, \\\"participants\\\": 1, \\\"not\\\": 616, \\\"receivers\\\": 1, \\\"fixed\\\": 28, \\\"body\\\": 28, \\\"aims\\\": 1, \\\"imply\\\": 2, \\\"considerable\\\": 15, \\\"change\\\": 31, \\\"routines\\\": 1, \\\"mode\\\": 7, \\\"functioning\\\": 1, \\\"flexibility\\\": 1, \\\"daily\\\": 9, \\\"table\\\": 5, \\\"necessary\\\": 20, \\\"rigour\\\": 1, \\\"implementing\\\": 1, \\\"annual\\\": 1, \\\"calendar\\\": 1, \\\"so\\\": 250, \\\"required\\\": 10, \\\"number\\\": 9, \\\"teaching\\\": 4, \\\"days\\\": 60, \\\"actually\\\": 5, \\\"devoted\\\": 15, \\\"methods\\\": 3, \\\"used\\\": 18, \\\"for\\\": 683, \\\"evaluation\\\": 6, \\\"determine\\\": 2, \\\"how\\\": 112, \\\"effective\\\": 1, \\\"proves\\\": 2, \\\"making\\\": 12, \\\"happy\\\": 48, \\\"experience\\\": 11, \\\"rather\\\": 32, \\\"than\\\": 138, \\\"source\\\": 33, \\\"stress\\\": 1, \\\"or\\\": 336, \\\"boredom\\\": 1, \\\"syllabus\\\": 1, \\\"designers\\\": 1, \\\"have\\\": 442, \\\"tried\\\": 18, \\\"address\\\": 6, \\\"problem\\\": 3, \\\"curricular\\\": 1, \\\"burden\\\": 5, \\\"restructuring\\\": 1, \\\"reorienting\\\": 1, \\\"stages\\\": 2, \\\"greater\\\": 27, \\\"consideration\\\": 10, \\\"psychology\\\": 1, \\\"available\\\": 4, \\\"attempts\\\": 4, \\\"enhance\\\": 1, \\\"endeavour\\\": 13, \\\"giving\\\": 5, \\\"higher\\\": 9, \\\"priority\\\": 1, \\\"opportunities\\\": 6, \\\"contemplation\\\": 2, \\\"wondering\\\": 1, \\\"discussion\\\": 1, \\\"small\\\": 25, \\\"groups\\\": 3, \\\"requiring\\\": 1, \\\"hands\\\": 44, \\\"council\\\": 2, \\\"educational\\\": 3, \\\"research\\\": 6, \\\"training\\\": 2, \\\"ncert\\\": 10, \\\"appreciates\\\": 1, \\\"hard\\\": 14, \\\"work\\\": 88, \\\"done\\\": 11, \\\"development\\\": 5, \\\"committee\\\": 6, \\\"responsible\\\": 2, \\\"book\\\": 20, \\\"wish\\\": 29, \\\"thank\\\": 12, \\\"chairperson\\\": 2, \\\"advisory\\\": 2, \\\"group\\\": 5, \\\"social\\\": 21, \\\"sciences\\\": 2, \\\"professor\\\": 24, \\\"hari\\\": 2, \\\"vasudevan\\\": 2, \\\"chief\\\": 13, \\\"advisor\\\": 3, \\\"neeladri\\\": 3, \\\"bhattacharya\\\": 4, \\\"centre\\\": 12, \\\"historical\\\": 10, \\\"studies\\\": 21, \\\"jawaharlal\\\": 8, \\\"nehru\\\": 8, \\\"university\\\": 26, \\\"delhi\\\": 42, \\\"guiding\\\": 3, \\\"several\\\": 62, \\\"contributed\\\": 3, \\\"grateful\\\": 6, \\\"indebted\\\": 3, \\\"institutions\\\": 4, \\\"organisations\\\": 1, \\\"generously\\\": 1, \\\"permitted\\\": 8, \\\"draw\\\": 9, \\\"upon\\\": 147, \\\"rationalised\\\": 36, \\\"2023\\\": 35, \\\"24\\\": 38, \\\"vi\\\": 2, \\\"material\\\": 6, \\\"personnel\\\": 1, \\\"especially\\\": 6, \\\"members\\\": 6, \\\"monitoring\\\": 2, \\\"appointed\\\": 2, \\\"department\\\": 6, \\\"secondary\\\": 3, \\\"ministry\\\": 1, \\\"human\\\": 61, \\\"resource\\\": 5, \\\"under\\\": 39, \\\"chairpersonship\\\": 1, \\\"mrinal\\\": 1, \\\"miri\\\": 1, \\\"g\\\": 4, \\\"p\\\": 4, \\\"deshpande\\\": 1, \\\"valuable\\\": 7, \\\"contribution\\\": 1, \\\"organisation\\\": 1, \\\"committed\\\": 14, \\\"systemic\\\": 1, \\\"reform\\\": 1, \\\"continuous\\\": 2, \\\"improvement\\\": 7, \\\"quality\\\": 4, \\\"its\\\": 152, \\\"products\\\": 1, \\\"welcomes\\\": 1, \\\"comments\\\": 2, \\\"suggestions\\\": 2, \\\"enable\\\": 5, \\\"undertake\\\": 5, \\\"revision\\\": 1, \\\"refinement\\\": 2, \\\"director\\\": 1, \\\"20\\\": 5, \\\"november\\\": 3, \\\"2006\\\": 1, \\\"vii\\\": 1, \\\"rationalisation\\\": 3, \\\"content\\\": 18, \\\"view\\\": 25, \\\"covid\\\": 1, \\\"19\\\": 4, \\\"pandemic\\\": 1, \\\"it\\\": 683, \\\"imperative\\\": 1, \\\"reduce\\\": 1, \\\"load\\\": 5, \\\"students\\\": 4, \\\"2020\\\": 1, \\\"emphasises\\\": 1, \\\"reducing\\\": 1, \\\"providing\\\": 6, \\\"experiential\\\": 1, \\\"creative\\\": 1, \\\"mindset\\\": 1, \\\"background\\\": 2, \\\"has\\\": 84, \\\"undertaken\\\": 1, \\\"exercise\\\": 9, \\\"rationalise\\\": 1, \\\"across\\\": 21, \\\"all\\\": 270, \\\"classes\\\": 11, \\\"outcomes\\\": 1, \\\"already\\\": 39, \\\"been\\\": 216, \\\"taken\\\": 38, \\\"into\\\": 161, \\\"contents\\\": 5, \\\"following\\\": 18, \\\"\\\\u2022\\\": 9, \\\"overlapping\\\": 2, \\\"similar\\\": 4, \\\"included\\\": 10, \\\"same\\\": 88, \\\"class\\\": 9, \\\"lower\\\": 8, \\\"difficulty\\\": 13, \\\"level\\\": 2, \\\"easily\\\": 23, \\\"accessible\\\": 4, \\\"without\\\": 50, \\\"much\\\": 65, \\\"interventions\\\": 1, \\\"can\\\": 126, \\\"learned\\\": 22, \\\"through\\\": 85, \\\"self\\\": 19, \\\"peer\\\": 2, \\\"irrelevant\\\": 1, \\\"present\\\": 35, \\\"context\\\": 1, \\\"edition\\\": 2, \\\"reformatted\\\": 1, \\\"version\\\": 9, \\\"after\\\": 87, \\\"carrying\\\": 5, \\\"out\\\": 69, \\\"changes\\\": 7, \\\"above\\\": 16, \\\"viii\\\": 2, \\\"ix\\\": 2, \\\"defining\\\": 1, \\\"focus\\\": 4, \\\"study\\\": 24, \\\"what\\\": 180, \\\"defines\\\": 1, \\\"does\\\": 25, \\\"seek\\\": 27, \\\"do\\\": 146, \\\"studied\\\": 7, \\\"earlier\\\": 6, \\\"looked\\\": 36, \\\"indian\\\": 35, \\\"history\\\": 69, \\\"early\\\": 20, \\\"beginnings\\\": 1, \\\"modern\\\": 19, \\\"times\\\": 17, \\\"chronological\\\": 2, \\\"period\\\": 20, \\\"each\\\": 43, \\\"year\\\": 15, \\\"then\\\": 122, \\\"books\\\": 17, \\\"x\\\": 2, \\\"frame\\\": 15, \\\"reference\\\": 4, \\\"changed\\\": 11, \\\"shorter\\\": 1, \\\"focusing\\\": 3, \\\"specifically\\\": 1, \\\"close\\\": 20, \\\"contemporary\\\": 6, \\\"world\\\": 67, \\\"moved\\\": 17, \\\"beyond\\\": 13, \\\"territorial\\\": 1, \\\"limits\\\": 1, \\\"nation\\\": 3, \\\"states\\\": 25, \\\"see\\\": 81, \\\"people\\\": 31, \\\"places\\\": 15, \\\"played\\\": 7, \\\"part\\\": 81, \\\"india\\\": 49, \\\"became\\\": 66, \\\"connected\\\": 9, \\\"wider\\\": 2, \\\"inter\\\": 3, \\\"subsequently\\\": 1, \\\"xi\\\": 2, \\\"themes\\\": 24, \\\"expanding\\\": 2, \\\"looking\\\": 16, \\\"vast\\\": 21, \\\"span\\\": 1, \\\"years\\\": 64, \\\"beginning\\\": 12, \\\"but\\\": 742, \\\"selecting\\\": 1, \\\"only\\\": 150, \\\"set\\\": 32, \\\"serious\\\": 4, \\\"exploration\\\": 1, \\\"begins\\\": 2, \\\"harappa\\\": 1, \\\"ends\\\": 2, \\\"framing\\\": 2, \\\"constitution\\\": 2, \\\"offers\\\": 3, \\\"general\\\": 12, \\\"survey\\\": 1, \\\"five\\\": 17, \\\"millennia\\\": 1, \\\"select\\\": 2, \\\"acquainted\\\": 21, \\\"you\\\": 703, \\\"explored\\\": 1, \\\"some\\\": 187, \\\"detail\\\": 9, \\\"choosing\\\": 1, \\\"ensure\\\": 5, \\\"learn\\\": 13, \\\"about\\\": 93, \\\"developments\\\": 3, \\\"spheres\\\": 1, \\\"\\\\u2013\\\": 19, \\\"economic\\\": 6, \\\"cultural\\\": 5, \\\"political\\\": 2, \\\"religious\\\": 11, \\\"even\\\": 111, \\\"break\\\": 5, \\\"introduce\\\": 2, \\\"politics\\\": 2, \\\"nature\\\": 59, \\\"authority\\\": 3, \\\"power\\\": 40, \\\"others\\\": 37, \\\"explore\\\": 5, \\\"way\\\": 31, \\\"societies\\\": 5, \\\"organised\\\": 2, \\\"function\\\": 1, \\\"still\\\": 75, \\\"tell\\\": 19, \\\"ritual\\\": 1, \\\"practices\\\": 6, \\\"working\\\": 4, \\\"economies\\\": 2, \\\"within\\\": 50, \\\"rural\\\": 5, \\\"urban\\\": 7, \\\"allow\\\": 15, \\\"closer\\\": 4, \\\"look\\\": 31, \\\"historians\\\\u2019\\\": 1, \\\"craft\\\": 5, \\\"retrieve\\\": 1, \\\"past\\\": 23, \\\"historians\\\": 13, \\\"find\\\": 33, \\\"sources\\\": 20, \\\"make\\\": 52, \\\"just\\\": 24, \\\"reveal\\\": 6, \\\"grapple\\\": 2, \\\"interpret\\\": 4, \\\"speak\\\": 19, \\\"makes\\\": 5, \\\"exciting\\\": 3, \\\"things\\\": 24, \\\"ask\\\": 12, \\\"engage\\\": 4, \\\"ways\\\": 7, \\\"need\\\": 12, \\\"read\\\": 44, \\\"discover\\\": 21, \\\"old\\\": 74, \\\"re\\\": 5, \\\"examine\\\": 6, \\\"records\\\": 7, \\\"ones\\\": 3, \\\"sometimes\\\": 70, \\\"could\\\": 221, \\\"chance\\\": 8, \\\"discoveries\\\": 9, \\\"archaeologists\\\": 1, \\\"may\\\": 134, \\\"unexpectedly\\\": 1, \\\"come\\\": 47, \\\"seals\\\": 3, \\\"mounds\\\": 1, \\\"provide\\\": 14, \\\"clues\\\": 6, \\\"existence\\\": 36, \\\"site\\\": 1, \\\"ancient\\\": 11, \\\"civilisation\\\": 2, \\\"rummaging\\\": 1, \\\"dusty\\\": 1, \\\"district\\\": 3, \\\"collectorate\\\": 1, \\\"historian\\\": 4, \\\"trip\\\": 2, \\\"over\\\": 72, \\\"bundle\\\": 2, \\\"contain\\\": 6, \\\"legal\\\": 3, \\\"cases\\\": 2, \\\"local\\\": 4, \\\"disputes\\\": 2, \\\"open\\\": 25, \\\"up\\\": 111, \\\"village\\\": 16, \\\"centuries\\\": 9, \\\"back\\\": 19, \\\"yet\\\": 160, \\\"such\\\": 118, \\\"accidents\\\": 6, \\\"bump\\\": 1, \\\"archive\\\": 14, \\\"discovering\\\": 4, \\\"significance\\\": 2, \\\"mean\\\": 14, \\\"nothing\\\": 44, \\\"unless\\\": 12, \\\"relevant\\\": 1, \\\"mind\\\": 91, \\\"track\\\": 4, \\\"text\\\": 5, \\\"follow\\\": 16, \\\"connections\\\": 1, \\\"before\\\": 172, \\\"reconstruct\\\": 2, \\\"physical\\\": 8, \\\"discovery\\\": 19, \\\"record\\\": 8, \\\"simply\\\": 2, \\\"when\\\": 354, \\\"alexander\\\": 1, \\\"cunningham\\\": 1, \\\"first\\\": 126, \\\"saw\\\": 121, \\\"harappan\\\": 2, \\\"seal\\\": 2, \\\"he\\\": 732, \\\"no\\\": 203, \\\"sense\\\": 19, \\\"later\\\": 8, \\\"was\\\": 1158, \\\"discovered\\\": 35, \\\"fact\\\": 8, \\\"begin\\\": 10, \\\"often\\\": 74, \\\"search\\\": 12, \\\"types\\\": 3, \\\"know\\\": 53, \\\"revolutionaries\\\": 1, \\\"rebels\\\": 3, \\\"official\\\": 8, \\\"partial\\\": 1, \\\"picture\\\": 16, \\\"shaped\\\": 3, \\\"censure\\\": 1, \\\"prejudice\\\": 3, \\\"diaries\\\": 1, \\\"personal\\\": 3, \\\"letters\\\": 21, \\\"writings\\\": 4, \\\"pronouncements\\\": 1, \\\"always\\\": 30, \\\"easy\\\": 4, \\\"understand\\\": 20, \\\"experiences\\\": 4, \\\"oral\\\": 4, \\\"might\\\": 115, \\\"more\\\": 193, \\\"written\\\": 16, \\\"vision\\\": 4, \\\"broadens\\\": 1, \\\"tracking\\\": 1, \\\"searching\\\": 2, \\\"happens\\\": 3, \\\"conception\\\": 8, \\\"constitutes\\\": 1, \\\"itself\\\": 27, \\\"there\\\": 139, \\\"were\\\": 396, \\\"acknowledged\\\": 2, \\\"authentic\\\": 2, \\\"verified\\\": 1, \\\"cited\\\": 1, \\\"cross\\\": 4, \\\"checked\\\": 4, \\\"evidence\\\": 13, \\\"never\\\": 79, \\\"considered\\\": 17, \\\"valid\\\": 1, \\\"who\\\": 228, \\\"guarantee\\\": 1, \\\"authenticity\\\": 1, \\\"verifiability\\\": 1, \\\"mistrust\\\": 1, \\\"disappeared\\\": 10, \\\"innovatively\\\": 1, \\\"uncover\\\": 1, \\\"enter\\\": 25, \\\"accompany\\\": 7, \\\"carry\\\": 5, \\\"dialogues\\\": 1, \\\"witness\\\": 4, \\\"tease\\\": 1, \\\"meaning\\\": 6, \\\"inscriptions\\\": 3, \\\"excavate\\\": 1, \\\"archaeological\\\": 2, \\\"beads\\\": 2, \\\"bones\\\": 6, \\\"epics\\\": 1, \\\"stupas\\\": 1, \\\"buildings\\\": 4, \\\"paintings\\\": 3, \\\"photographs\\\": 2, \\\"police\\\": 2, \\\"reports\\\": 3, \\\"revenue\\\": 5, \\\"listen\\\": 12, \\\"voices\\\": 5, \\\"theme\\\": 27, \\\"peculiarities\\\": 1, \\\"possibilities\\\": 1, \\\"particular\\\": 8, \\\"type\\\": 3, \\\"discuss\\\": 13, \\\"cannot\\\": 55, \\\"ii\\\": 16, \\\"iii\\\": 4, \\\"calcutta\\\": 1, \\\"kolkata\\\": 2, \\\"9\\\": 13, \\\"advisors\\\": 1, \\\"kumkum\\\": 2, \\\"roy\\\": 5, \\\"associate\\\": 5, \\\"monica\\\": 1, \\\"juneja\\\": 1, \\\"guest\\\": 10, \\\"institut\\\": 1, \\\"furgeschichte\\\": 1, \\\"viennna\\\": 1, \\\"austria\\\": 2, \\\"team\\\": 1, \\\"jaya\\\": 1, \\\"menon\\\": 1, \\\"reader\\\": 6, \\\"aligarh\\\": 4, \\\"muslim\\\": 3, \\\"1\\\": 68, \\\"2\\\": 21, \\\"kunal\\\": 1, \\\"chakrabarti\\\": 1, \\\"3\\\": 23, \\\"uma\\\": 1, \\\"chakravarti\\\": 2, \\\"formerly\\\": 7, \\\"miranda\\\": 1, \\\"house\\\": 46, \\\"4\\\": 17, \\\"farhat\\\": 1, \\\"hassan\\\": 1, \\\"5\\\": 32, \\\"meenakshi\\\": 1, \\\"khanna\\\": 1, \\\"indraprastha\\\": 1, \\\"college\\\": 7, \\\"6\\\": 13, \\\"vijaya\\\": 1, \\\"ramaswamy\\\": 1, \\\"7\\\": 12, \\\"rajat\\\": 1, \\\"datta\\\": 2, \\\"8\\\": 18, \\\"najaf\\\": 1, \\\"haider\\\": 1, \\\"rudrangshu\\\": 1, \\\"mukherjee\\\": 1, \\\"executive\\\": 1, \\\"editor\\\": 1, \\\"telegraph\\\": 1, \\\"10\\\": 7, \\\"partho\\\": 1, \\\"dutta\\\": 1, \\\"zakir\\\": 1, \\\"hussain\\\": 1, \\\"evening\\\": 14, \\\"ramachandra\\\": 1, \\\"guha\\\": 1, \\\"freelance\\\": 1, \\\"writer\\\": 1, \\\"anthropologist\\\": 1, \\\"bangalore\\\": 1, \\\"11\\\": 8, \\\"sumit\\\": 1, \\\"sarkar\\\": 1, \\\"12\\\": 6, \\\"muzaffar\\\": 1, \\\"alam\\\": 1, \\\"south\\\": 12, \\\"asian\\\": 3, \\\"chicago\\\": 2, \\\"usa\\\": 1, \\\"c\\\": 16, \\\"n\\\": 2, \\\"subramaniam\\\": 1, \\\"eklavya\\\": 2, \\\"kothi\\\": 2, \\\"bazar\\\": 2, \\\"hoshangabad\\\": 2, \\\"rashmi\\\": 1, \\\"paliwal\\\": 1, \\\"prabha\\\": 1, \\\"singh\\\": 3, \\\"t\\\": 6, \\\"kendriya\\\": 4, \\\"vidyalaya\\\": 4, \\\"cantt\\\": 1, \\\"telliarganj\\\": 1, \\\"allahabad\\\": 1, \\\"smita\\\": 1, \\\"sahay\\\": 1, \\\"blue\\\": 14, \\\"bells\\\": 3, \\\"kailash\\\": 1, \\\"colony\\\": 1, \\\"beeba\\\": 1, \\\"sobti\\\": 1, \\\"barakhamba\\\": 1, \\\"road\\\": 7, \\\"member\\\": 1, \\\"coordinators\\\": 1, \\\"anil\\\": 1, \\\"sethi\\\": 1, \\\"dess\\\": 8, \\\"seema\\\": 3, \\\"shukla\\\": 1, \\\"ojha\\\": 3, \\\"lecturer\\\": 1, \\\"xii\\\": 1, \\\"acknowledgements\\\": 1, \\\"like\\\": 95, \\\"i\\\": 2871, \\\"benefited\\\": 1, \\\"enthusiastic\\\": 5, \\\"participation\\\": 1, \\\"help\\\": 14, \\\"many\\\": 91, \\\"whom\\\": 91, \\\"pleasure\\\": 37, \\\"extensive\\\": 4, \\\"draft\\\": 1, \\\"chapters\\\": 5, \\\"immensely\\\": 1, \\\"john\\\": 3, \\\"fritz\\\": 2, \\\"sunil\\\": 2, \\\"kumar\\\": 3, \\\"supriya\\\": 1, \\\"varma\\\": 2, \\\"would\\\": 210, \\\"meena\\\": 1, \\\"bhargava\\\": 1, \\\"ranabir\\\": 1, \\\"ranjeeta\\\": 1, \\\"bharati\\\": 1, \\\"jagannathan\\\": 1, \\\"nandita\\\": 1, \\\"prasad\\\": 1, \\\"sahai\\\": 1, \\\"prompt\\\": 1, \\\"clarifying\\\": 1, \\\"issues\\\": 2, \\\"made\\\": 85, \\\"prof\\\": 1, \\\"j\\\": 1, \\\"s\\\": 17, \\\"grewal\\\": 1, \\\"shobha\\\": 1, \\\"bajpai\\\": 1, \\\"very\\\": 93, \\\"useful\\\": 7, \\\"visual\\\": 3, \\\"provided\\\": 17, \\\"individuals\\\": 1, \\\"george\\\": 1, \\\"michell\\\": 1, \\\"generosity\\\": 3, \\\"allowing\\\": 2, \\\"rich\\\": 11, \\\"pool\\\": 4, \\\"vijayanagara\\\": 3, \\\"careful\\\": 1, \\\"copy\\\": 17, \\\"editing\\\": 1, \\\"reading\\\": 5, \\\"proofs\\\": 1, \\\"gratefully\\\": 2, \\\"acknowledge\\\": 1, \\\"efforts\\\": 4, \\\"shyama\\\": 1, \\\"warner\\\": 1, \\\"thanks\\\": 4, \\\"equally\\\": 5, \\\"due\\\": 4, \\\"ritu\\\": 1, \\\"topa\\\": 1, \\\"animesh\\\": 1, \\\"arrt\\\": 1, \\\"creations\\\": 3, \\\"designed\\\": 2, \\\"patience\\\": 4, \\\"skill\\\": 3, \\\"k\\\": 4, \\\"varghese\\\": 1, \\\"maps\\\": 3, \\\"albinus\\\": 1, \\\"tirkey\\\": 1, \\\"manoj\\\": 1, \\\"haldar\\\": 1, \\\"offered\\\": 3, \\\"technical\\\": 1, \\\"support\\\": 18, \\\"samira\\\": 1, \\\"least\\\": 18, \\\"remaining\\\": 8, \\\"cheerful\\\": 13, \\\"throughout\\\": 2, \\\"finally\\\": 6, \\\"forward\\\": 17, \\\"feedback\\\": 1, \\\"users\\\": 1, \\\"improve\\\": 4, \\\"subsequent\\\": 3, \\\"editions\\\": 5, \\\"review\\\": 2, \\\"committe\\\": 2, \\\"umesh\\\": 2, \\\"ashok\\\": 2, \\\"kadam\\\": 2, \\\"jnu\\\": 2, \\\"svaril\\\": 1, \\\"pgt\\\": 6, \\\"krishna\\\": 2, \\\"ranjan\\\": 2, \\\"kedriya\\\": 1, \\\"vidalaya\\\": 1, \\\"archana\\\": 2, \\\"verma\\\": 2, \\\"dept\\\": 2, \\\"hindu\\\": 4, \\\"shruti\\\": 2, \\\"mishra\\\": 2, \\\"hod\\\": 2, \\\"public\\\": 14, \\\"gouri\\\": 2, \\\"srivastava\\\": 2, \\\"head\\\": 44, \\\"pratyusa\\\": 2, \\\"khandal\\\": 1, \\\"mily\\\": 2, \\\"anand\\\": 2, \\\"sharad\\\": 2, \\\"pandey\\\": 2, \\\"mandal\\\": 1, \\\"xiii\\\": 1, \\\"eyes\\\": 124, \\\"travellers\\\": 37, \\\"115\\\": 3, \\\"perceptions\\\": 4, \\\"society\\\": 32, \\\"tenth\\\": 5, \\\"seventeenth\\\": 11, \\\"century\\\": 32, \\\"six\\\": 9, \\\"bhakti\\\": 1, \\\"sufi\\\": 1, \\\"traditions\\\": 3, \\\"140\\\": 1, \\\"beliefs\\\": 5, \\\"devotional\\\": 1, \\\"texts\\\": 12, \\\"eighth\\\": 2, \\\"eighteenth\\\": 5, \\\"seven\\\": 5, \\\"imperial\\\": 10, \\\"capital\\\": 2, \\\"170\\\": 1, \\\"fourteenth\\\": 6, \\\"sixteenth\\\": 7, \\\"eight\\\": 9, \\\"peasants\\\": 11, \\\"zamindars\\\": 3, \\\"state\\\": 42, \\\"196\\\": 1, \\\"agrarian\\\": 1, \\\"mughal\\\": 18, \\\"empire\\\": 12, \\\"nine\\\": 4, \\\"colonialism\\\": 2, \\\"countryside\\\": 2, \\\"exploring\\\": 2, \\\"archives\\\": 2, \\\"ten\\\": 15, \\\"raj\\\": 1, \\\"1857\\\": 1, \\\"revolt\\\": 2, \\\"representations\\\": 4, \\\"xiv\\\": 3, \\\"eleven\\\": 3, \\\"mahatma\\\": 1, \\\"gandhi\\\": 1, \\\"nationalist\\\": 1, \\\"movement\\\": 1, \\\"civil\\\": 1, \\\"disobedience\\\": 1, \\\"twelve\\\": 5, \\\"era\\\": 2, \\\"pages\\\": 2, \\\"114\\\": 2, \\\"bricks\\\": 2, \\\"two\\\": 60, \\\"kings\\\": 6, \\\"farmers\\\": 2, \\\"towns\\\": 16, \\\"600\\\": 6, \\\"bce\\\": 5, \\\"ce\\\": 3, \\\"three\\\": 20, \\\"kinship\\\": 1, \\\"caste\\\": 10, \\\"four\\\": 13, \\\"thinkers\\\": 1, \\\"xv\\\": 1, \\\"use\\\": 31, \\\"r\\\": 8, \\\"chapter\\\": 198, \\\"divided\\\": 2, \\\"numbered\\\": 2, \\\"sections\\\": 3, \\\"subsections\\\": 1, \\\"facilitate\\\": 1, \\\"enclosed\\\": 2, \\\"boxes\\\": 2, \\\"timelines\\\": 1, \\\"treated\\\": 2, \\\"figures\\\": 3, \\\"sequentially\\\": 1, \\\"include\\\": 5, \\\"illustrations\\\": 3, \\\"artefacts\\\": 1, \\\"tools\\\": 5, \\\"pottery\\\": 1, \\\"coins\\\": 2, \\\"ornaments\\\": 2, \\\"etc\\\": 6, \\\"well\\\": 64, \\\"sculptures\\\": 1, \\\"plans\\\": 8, \\\"b\\\": 4, \\\"separate\\\": 2, \\\"excerpts\\\": 2, \\\"wide\\\": 13, \\\"variety\\\": 9, \\\"both\\\": 21, \\\"textual\\\": 1, \\\"acquire\\\": 3, \\\"feel\\\": 54, \\\"analyse\\\": 3, \\\"final\\\": 4, \\\"identical\\\": 1, \\\"opportunity\\\": 7, \\\"handle\\\": 3, \\\"short\\\": 24, \\\"meanings\\\": 1, \\\"additional\\\": 8, \\\"elaborate\\\": 1, \\\"definitions\\\": 1, \\\"meant\\\": 5, \\\"assist\\\": 7, \\\"enrich\\\": 1, \\\"process\\\": 4, \\\"intended\\\": 9, \\\"xvi\\\": 2, \\\"categories\\\": 3, \\\"intext\\\": 1, \\\"those\\\": 114, \\\"yellow\\\": 5, \\\"box\\\": 2, \\\"practice\\\": 7, \\\"caption\\\": 1, \\\"\\\\u2039discuss\\\": 1, \\\"assignments\\\": 1, \\\"end\\\": 27, \\\"projects\\\": 4, \\\"assessment\\\": 2, \\\"essays\\\": 1, \\\"map\\\": 5, \\\"enjoy\\\": 10, \\\"using\\\": 11, \\\"women\\\": 18, \\\"men\\\": 63, \\\"travelled\\\": 17, \\\"escape\\\": 11, \\\"natural\\\": 25, \\\"disasters\\\": 2, \\\"traders\\\": 1, \\\"merchants\\\": 6, \\\"soldiers\\\": 1, \\\"priests\\\": 3, \\\"pilgrims\\\": 2, \\\"driven\\\": 8, \\\"adventure\\\": 2, \\\"visit\\\": 26, \\\"stay\\\": 7, \\\"land\\\": 51, \\\"invariably\\\": 1, \\\"encounter\\\": 6, \\\"terms\\\": 34, \\\"landscape\\\": 5, \\\"environment\\\": 2, \\\"customs\\\": 6, \\\"languages\\\": 14, \\\"try\\\": 8, \\\"adapt\\\": 2, \\\"differences\\\": 4, \\\"somewhat\\\": 6, \\\"exceptional\\\": 1, \\\"note\\\": 4, \\\"carefully\\\": 4, \\\"accounts\\\": 18, \\\"generally\\\": 14, \\\"recording\\\": 4, \\\"unusual\\\": 7, \\\"remarkable\\\": 4, \\\"unfortunately\\\": 4, \\\"practically\\\": 3, \\\"travel\\\": 12, \\\"left\\\": 41, \\\"though\\\": 12, \\\"survive\\\": 8, \\\"varied\\\": 4, \\\"matter\\\": 9, \\\"deal\\\": 4, \\\"affairs\\\": 4, \\\"court\\\": 17, \\\"while\\\": 81, \\\"mainly\\\": 1, \\\"focused\\\": 1, \\\"architectural\\\": 2, \\\"features\\\": 9, \\\"monuments\\\": 2, \\\"example\\\": 6, \\\"most\\\": 124, \\\"important\\\": 9, \\\"descriptions\\\": 6, \\\"city\\\": 28, \\\"fifteenth\\\": 3, \\\"comes\\\": 2, \\\"abdur\\\": 3, \\\"razzaq\\\": 4, \\\"samarqandi\\\": 3, \\\"diplomat\\\": 1, \\\"came\\\": 60, \\\"visiting\\\": 2, \\\"herat\\\": 1, \\\"few\\\": 70, \\\"did\\\": 144, \\\"go\\\": 39, \\\"distant\\\": 15, \\\"lands\\\": 6, \\\"administrators\\\": 1, \\\"recorded\\\": 7, \\\"observations\\\": 6, \\\"interested\\\": 7, \\\"popular\\\": 3, \\\"folklore\\\": 1, \\\"shall\\\": 112, \\\"enriched\\\": 1, \\\"visited\\\": 27, \\\"subcontinent\\\": 15, \\\"al\\\": 37, \\\"biruni\\\": 26, \\\"uzbekistan\\\": 3, \\\"eleventh\\\": 2, \\\"ibn\\\": 57, \\\"battuta\\\": 44, \\\"morocco\\\": 3, \\\"northwestern\\\": 1, \\\"africa\\\": 6, \\\"frenchman\\\": 2, \\\"fran\\\\u00e7ois\\\": 5, \\\"bernier\\\": 32, \\\"fig\\\": 14, \\\"1b\\\": 1, \\\"coconut\\\": 6, \\\"paan\\\": 6, \\\"struck\\\": 13, \\\"1a\\\": 1, \\\"leaves\\\": 16, \\\"116\\\": 2, \\\"authors\\\": 9, \\\"vastly\\\": 1, \\\"environments\\\": 1, \\\"attentive\\\": 3, \\\"everyday\\\": 2, \\\"granted\\\": 3, \\\"indigenous\\\": 1, \\\"writers\\\": 8, \\\"routine\\\": 3, \\\"matters\\\": 3, \\\"worthy\\\": 6, \\\"being\\\": 114, \\\"difference\\\": 13, \\\"perspective\\\": 1, \\\"interesting\\\": 12, \\\"write\\\": 15, \\\"answers\\\": 2, \\\"vary\\\": 1, \\\"instance\\\": 13, \\\"next\\\": 17, \\\"kitab\\\": 4, \\\"ul\\\": 4, \\\"hind\\\": 5, \\\"khwarizm\\\": 4, \\\"punjab\\\": 4, \\\"born\\\": 8, \\\"973\\\": 2, \\\"presentday\\\": 1, \\\"received\\\": 25, \\\"best\\\": 21, \\\"versed\\\": 1, \\\"syriac\\\": 1, \\\"arabic\\\": 16, \\\"persian\\\": 10, \\\"hebrew\\\": 2, \\\"sanskrit\\\": 12, \\\"although\\\": 56, \\\"greek\\\": 7, \\\"familiar\\\": 11, \\\"works\\\": 55, \\\"plato\\\": 1, \\\"philosophers\\\": 6, \\\"having\\\": 29, \\\"translations\\\": 2, \\\"1017\\\": 1, \\\"sultan\\\": 8, \\\"mahmud\\\": 4, \\\"invaded\\\": 1, \\\"took\\\": 45, \\\"scholars\\\": 4, \\\"poets\\\": 6, \\\"his\\\": 646, \\\"ghazni\\\": 3, \\\"arrived\\\": 34, \\\"hostage\\\": 1, \\\"gradually\\\": 8, \\\"liking\\\": 1, \\\"where\\\": 103, \\\"spent\\\": 30, \\\"rest\\\": 34, \\\"until\\\": 57, \\\"death\\\": 84, \\\"age\\\": 15, \\\"70\\\": 2, \\\"interest\\\": 18, \\\"astronomy\\\": 3, \\\"mathematics\\\": 4, \\\"medicine\\\": 3, \\\"had\\\": 727, \\\"translated\\\": 6, \\\"onwards\\\": 3, \\\"ghaznavid\\\": 1, \\\"contacts\\\": 1, \\\"population\\\": 9, \\\"helped\\\": 4, \\\"create\\\": 10, \\\"mutual\\\": 6, \\\"trust\\\": 8, \\\"understanding\\\": 12, \\\"company\\\": 7, \\\"brahmana\\\": 5, \\\"studying\\\": 3, \\\"philosophical\\\": 3, \\\"itinerary\\\": 1, \\\"clear\\\": 13, \\\"likely\\\": 2, \\\"widely\\\": 2, \\\"parts\\\": 13, \\\"northern\\\": 10, \\\"literature\\\": 5, \\\"accepted\\\": 3, \\\"wrote\\\": 14, \\\"dealt\\\": 1, \\\"far\\\": 50, \\\"apart\\\": 3, \\\"sahara\\\": 1, \\\"desert\\\": 12, \\\"west\\\": 10, \\\"river\\\": 15, \\\"volga\\\": 1, \\\"north\\\": 19, \\\"translating\\\": 1, \\\"sharing\\\": 2, \\\"ideas\\\": 18, \\\"biruni\\\\u2019s\\\": 7, \\\"expertise\\\": 2, \\\"allowed\\\": 23, \\\"him\\\": 247, \\\"compare\\\": 10, \\\"translate\\\": 1, \\\"including\\\": 13, \\\"patanjali\\\\u2019s\\\": 1, \\\"grammar\\\": 2, \\\"friends\\\": 56, \\\"euclid\\\": 1, \\\"mathematician\\\": 1, \\\"objectives\\\": 3, \\\"described\\\": 18, \\\"want\\\": 17, \\\"hindus\\\": 3, \\\"repertory\\\": 1, \\\"\\\\u00fc\\\": 24, \\\"excerpt\\\": 9, \\\"whether\\\": 22, \\\"met\\\": 11, \\\"117\\\": 2, \\\"1500\\\": 3, \\\"simple\\\": 9, \\\"lucid\\\": 1, \\\"voluminous\\\": 1, \\\"80\\\": 2, \\\"subjects\\\": 10, \\\"religion\\\": 4, \\\"philosophy\\\": 16, \\\"festivals\\\": 1, \\\"alchemy\\\": 1, \\\"manners\\\": 20, \\\"weights\\\": 1, \\\"iconography\\\": 1, \\\"laws\\\": 22, \\\"metrology\\\": 2, \\\"adopted\\\": 4, \\\"distinctive\\\": 1, \\\"structure\\\": 6, \\\"question\\\": 11, \\\"description\\\": 20, \\\"based\\\": 3, \\\"sanskritic\\\": 2, \\\"concluding\\\": 1, \\\"comparison\\\": 3, \\\"cultures\\\": 2, \\\"day\\\": 89, \\\"argued\\\": 3, \\\"almost\\\": 49, \\\"geometric\\\": 1, \\\"precision\\\": 3, \\\"predictability\\\": 1, \\\"owed\\\": 6, \\\"mathematical\\\": 1, \\\"orientation\\\": 1, \\\"probably\\\": 8, \\\"peoples\\\": 4, \\\"living\\\": 14, \\\"along\\\": 17, \\\"frontiers\\\": 2, \\\"adaptations\\\": 1, \\\"pali\\\": 1, \\\"prakrit\\\": 1, \\\"ranged\\\": 2, \\\"fables\\\": 1, \\\"however\\\": 44, \\\"critical\\\": 4, \\\"clearly\\\": 4, \\\"wanted\\\": 1, \\\"science\\\": 29, \\\"measurement\\\": 2, \\\"term\\\": 4, \\\"\\\\u201chindu\\\\u201d\\\": 2, \\\"derived\\\": 3, \\\"word\\\": 18, \\\"sixth\\\": 5, \\\"fifth\\\": 3, \\\"refer\\\": 1, \\\"region\\\": 9, \\\"east\\\": 9, \\\"sindhu\\\": 1, \\\"indus\\\": 3, \\\"arabs\\\": 1, \\\"continued\\\": 34, \\\"usage\\\": 2, \\\"called\\\": 40, \\\"\\\\u201cal\\\": 1, \\\"hind\\\\u201d\\\": 1, \\\"\\\\u201chindi\\\\u201d\\\": 1, \\\"turks\\\": 2, \\\"referred\\\": 2, \\\"\\\\u201chindustan\\\\u201d\\\": 1, \\\"language\\\": 29, \\\"\\\\u201chindavi\\\\u201d\\\": 1, \\\"none\\\": 21, \\\"expressions\\\": 3, \\\"indicated\\\": 3, \\\"identity\\\": 1, \\\"connotations\\\": 1, \\\"lived\\\": 26, \\\"twenty\\\": 8, \\\"understood\\\": 16, \\\"knew\\\": 36, \\\"illustration\\\": 1, \\\"thirteenthcentury\\\": 1, \\\"manuscript\\\": 2, \\\"showing\\\": 1, \\\"athenian\\\": 1, \\\"statesman\\\": 1, \\\"poet\\\": 3, \\\"solon\\\": 2, \\\"addressing\\\": 1, \\\"notice\\\": 13, \\\"clothes\\\": 9, \\\"shown\\\": 7, \\\"arabian\\\": 15, \\\"118\\\": 2, \\\"battuta\\\\u2019s\\\": 10, \\\"rihla\\\": 4, \\\"globe\\\": 10, \\\"trotter\\\": 2, \\\"travels\\\": 8, \\\"provides\\\": 2, \\\"extremely\\\": 7, \\\"details\\\": 5, \\\"moroccan\\\": 1, \\\"traveller\\\": 13, \\\"tangier\\\": 2, \\\"respectable\\\": 3, \\\"educated\\\": 4, \\\"families\\\": 5, \\\"known\\\": 24, \\\"islamic\\\": 1, \\\"law\\\": 13, \\\"shari\\\\u2018a\\\": 1, \\\"true\\\": 29, \\\"tradition\\\": 3, \\\"family\\\": 33, \\\"literary\\\": 15, \\\"scholastic\\\": 1, \\\"quite\\\": 7, \\\"young\\\": 33, \\\"unlike\\\": 8, \\\"gained\\\": 14, \\\"loved\\\": 32, \\\"travelling\\\": 9, \\\"went\\\": 24, \\\"off\\\": 23, \\\"worlds\\\": 2, \\\"1332\\\": 1, \\\"33\\\": 2, \\\"pilgrimage\\\": 6, \\\"trips\\\": 1, \\\"mecca\\\": 1, \\\"extensively\\\": 3, \\\"syria\\\": 1, \\\"iraq\\\": 1, \\\"persia\\\": 2, \\\"yemen\\\": 1, \\\"oman\\\": 1, \\\"trading\\\": 3, \\\"ports\\\": 1, \\\"coast\\\": 6, \\\"overland\\\": 1, \\\"central\\\": 4, \\\"asia\\\": 11, \\\"reached\\\": 11, \\\"sind\\\": 5, \\\"1333\\\": 1, \\\"heard\\\": 65, \\\"muhammad\\\": 5, \\\"bin\\\": 3, \\\"tughlaq\\\": 3, \\\"lured\\\": 1, \\\"reputation\\\": 2, \\\"generous\\\": 8, \\\"patron\\\": 1, \\\"arts\\\": 3, \\\"passing\\\": 9, \\\"multan\\\": 6, \\\"uch\\\": 1, \\\"impressed\\\": 11, \\\"scholarship\\\": 1, \\\"qazi\\\": 4, \\\"judge\\\": 9, \\\"remained\\\": 33, \\\"position\\\": 2, \\\"fell\\\": 20, \\\"favour\\\": 7, \\\"thrown\\\": 12, \\\"prison\\\": 14, \\\"once\\\": 41, \\\"misunderstanding\\\": 1, \\\"cleared\\\": 4, \\\"restored\\\": 17, \\\"service\\\": 7, \\\"ordered\\\": 4, \\\"1342\\\": 1, \\\"proceed\\\": 11, \\\"china\\\": 7, \\\"sultan\\\\u2019s\\\": 2, \\\"envoy\\\": 1, \\\"mongol\\\": 1, \\\"ruler\\\": 4, \\\"assignment\\\": 1, \\\"proceeded\\\": 19, \\\"malabar\\\": 3, \\\"maldives\\\": 2, \\\"stayed\\\": 3, \\\"eighteen\\\": 1, \\\"months\\\": 39, \\\"eventually\\\": 1, \\\"decided\\\": 5, \\\"sri\\\": 1, \\\"lanka\\\": 1, \\\"resuming\\\": 1, \\\"mission\\\": 5, \\\"bengal\\\": 3, \\\"assam\\\": 1, \\\"ship\\\": 23, \\\"sumatra\\\": 2, \\\"another\\\": 54, \\\"chinese\\\": 1, \\\"port\\\": 5, \\\"town\\\": 31, \\\"robbers\\\": 6, \\\"attacking\\\": 1, \\\"painting\\\": 5, \\\"distinguish\\\": 7, \\\"bird\\\": 2, \\\"nest\\\": 1, \\\"my\\\": 1792, \\\"birthplace\\\": 1, \\\"place\\\": 80, \\\"thursday\\\": 3, \\\"alone\\\": 47, \\\"neither\\\": 9, \\\"fellowtraveller\\\": 1, \\\"nor\\\": 38, \\\"caravan\\\": 4, \\\"whose\\\": 54, \\\"party\\\": 5, \\\"join\\\": 9, \\\"swayed\\\": 2, \\\"overmastering\\\": 1, \\\"impulse\\\": 6, \\\"me\\\": 901, \\\"desire\\\": 29, \\\"long\\\": 62, \\\"cherished\\\": 4, \\\"bosom\\\": 11, \\\"illustrious\\\": 3, \\\"sanctuaries\\\": 1, \\\"braced\\\": 1, \\\"resolution\\\": 9, \\\"quit\\\": 18, \\\"dear\\\": 70, \\\"female\\\": 17, \\\"male\\\": 3, \\\"forsook\\\": 1, \\\"birds\\\": 6, \\\"forsake\\\": 1, \\\"nests\\\": 1, \\\"returned\\\": 35, \\\"1354\\\": 1, \\\"30\\\": 3, \\\"119\\\": 2, \\\"zaytun\\\": 1, \\\"now\\\": 171, \\\"quanzhou\\\": 1, \\\"going\\\": 15, \\\"beijing\\\": 1, \\\"deciding\\\": 1, \\\"return\\\": 56, \\\"1347\\\": 1, \\\"account\\\": 43, \\\"compared\\\": 7, \\\"marco\\\": 2, \\\"polo\\\": 2, \\\"base\\\": 7, \\\"venice\\\": 1, \\\"late\\\": 12, \\\"thirteenth\\\": 2, \\\"meticulously\\\": 1, \\\"values\\\": 1, \\\"bear\\\": 8, \\\"arduous\\\": 2, \\\"hazardous\\\": 1, \\\"today\\\": 4, \\\"according\\\": 12, \\\"forty\\\": 5, \\\"fifty\\\": 5, \\\"distance\\\": 21, \\\"daulatabad\\\": 4, \\\"covered\\\": 22, \\\"gwalior\\\": 1, \\\"boat\\\": 24, \\\"passengers\\\": 5, \\\"terracotta\\\": 1, \\\"sculpture\\\": 1, \\\"temple\\\": 4, \\\"think\\\": 43, \\\"arms\\\": 10, \\\"lonely\\\": 3, \\\"hazard\\\": 2, \\\"journeys\\\": 1, \\\"homesick\\\": 1, \\\"fall\\\": 13, \\\"ill\\\": 22, \\\"here\\\": 50, \\\"attacked\\\": 6, \\\"fever\\\": 11, \\\"tied\\\": 3, \\\"myself\\\": 142, \\\"saddle\\\": 1, \\\"turbancloth\\\": 1, \\\"case\\\": 13, \\\"should\\\": 169, \\\"reason\\\": 16, \\\"weakness\\\": 4, \\\"last\\\": 37, \\\"tunis\\\": 1, \\\"townsfolk\\\": 1, \\\"welcome\\\": 8, \\\"shaikh\\\": 3, \\\"son\\\": 20, \\\"sides\\\": 13, \\\"greetings\\\": 1, \\\"soul\\\": 42, \\\"said\\\": 112, \\\"greeting\\\": 3, \\\"since\\\": 29, \\\"felt\\\": 83, \\\"sad\\\": 11, \\\"heart\\\": 85, \\\"loneliness\\\": 1, \\\"restrain\\\": 3, \\\"tears\\\": 35, \\\"started\\\": 8, \\\"wept\\\": 18, \\\"bitterly\\\": 12, \\\"realising\\\": 1, \\\"cause\\\": 36, \\\"distress\\\": 4, \\\"120\\\": 2, \\\"insecure\\\": 1, \\\"bands\\\": 1, \\\"preferred\\\": 2, \\\"companions\\\": 13, \\\"deter\\\": 1, \\\"highway\\\": 1, \\\"fellow\\\": 32, \\\"lost\\\": 38, \\\"lives\\\": 16, \\\"survived\\\": 1, \\\"severely\\\": 1, \\\"wounded\\\": 4, \\\"\\\\u201cenjoyment\\\": 1, \\\"curiosities\\\\u201d\\\": 1, \\\"seen\\\": 31, \\\"inveterate\\\": 1, \\\"russia\\\": 4, \\\"returning\\\": 11, \\\"native\\\": 29, \\\"issued\\\": 2, \\\"instructions\\\": 4, \\\"stories\\\": 2, \\\"afghanistan\\\": 1, \\\"names\\\": 19, \\\"spelt\\\": 2, \\\"sketch\\\": 1, \\\"scale\\\": 3, \\\"sea\\\": 66, \\\"andkhoy\\\": 1, \\\"tirmidh\\\": 1, \\\"balkh\\\": 2, \\\"qunduz\\\": 1, \\\"parwan\\\": 1, \\\"kabul\\\": 1, \\\"ghazna\\\": 1, \\\"qandahar\\\": 1, \\\"ajudahan\\\": 1, \\\"uja\\\": 1, \\\"hansi\\\": 1, \\\"dehli\\\": 5, \\\"sarasati\\\": 1, \\\"abuhar\\\": 1, \\\"lahari\\\": 1, \\\"sutlej\\\": 1, \\\"calculate\\\": 2, \\\"miles\\\": 14, \\\"0\\\": 1, \\\"100\\\": 2, \\\"200\\\": 1, \\\"300\\\": 2, \\\"121\\\": 2, \\\"entertainment\\\": 3, \\\"juzayy\\\": 1, \\\"deputed\\\": 1, \\\"dictated\\\": 3, \\\"introduction\\\": 4, \\\"gracious\\\": 1, \\\"transmitted\\\": 1, \\\"dictate\\\": 3, \\\"cities\\\": 7, \\\"events\\\": 19, \\\"clung\\\": 5, \\\"memory\\\": 19, \\\"rulers\\\": 5, \\\"countries\\\": 6, \\\"distinguished\\\": 11, \\\"pious\\\": 1, \\\"saints\\\": 1, \\\"accordingly\\\": 12, \\\"narrative\\\": 7, \\\"gave\\\": 35, \\\"delight\\\": 32, \\\"ears\\\": 10, \\\"curious\\\": 2, \\\"particulars\\\": 4, \\\"exposition\\\": 1, \\\"edification\\\": 1, \\\"marvellous\\\": 6, \\\"referring\\\": 1, \\\"aroused\\\": 2, \\\"footsteps\\\": 4, \\\"1400\\\": 1, \\\"1800\\\": 2, \\\"visitors\\\": 2, \\\"travelogues\\\": 1, \\\"iran\\\": 2, \\\"ottoman\\\": 2, \\\"followed\\\": 25, \\\"among\\\": 63, \\\"1440s\\\": 2, \\\"wali\\\": 2, \\\"balkhi\\\": 3, \\\"1620s\\\": 1, \\\"ali\\\": 2, \\\"hazin\\\": 2, \\\"1740s\\\": 1, \\\"fascinated\\\": 2, \\\"sort\\\": 10, \\\"sanyasi\\\": 1, \\\"disappointed\\\": 5, \\\"disgusted\\\": 2, \\\"expected\\\": 15, \\\"receive\\\": 10, \\\"red\\\": 6, \\\"carpet\\\": 5, \\\"treatment\\\": 8, \\\"wonders\\\": 6, \\\"depicting\\\": 4, \\\"gathered\\\": 7, \\\"around\\\": 40, \\\"campfire\\\": 1, \\\"writing\\\": 8, \\\"122\\\": 2, \\\"doctor\\\": 3, \\\"portuguese\\\": 2, \\\"detailed\\\": 5, \\\"regarding\\\": 4, \\\"jesuit\\\": 1, \\\"roberto\\\": 1, \\\"nobili\\\": 1, \\\"european\\\": 10, \\\"duarte\\\": 2, \\\"barbosa\\\": 2, \\\"trade\\\": 5, \\\"1600\\\": 3, \\\"growing\\\": 2, \\\"numbers\\\": 1, \\\"dutch\\\": 6, \\\"english\\\": 16, \\\"french\\\": 12, \\\"coming\\\": 5, \\\"famous\\\": 2, \\\"jeweller\\\": 1, \\\"jean\\\": 2, \\\"baptiste\\\": 2, \\\"tavernier\\\": 4, \\\"particularly\\\": 14, \\\"conditions\\\": 3, \\\"italian\\\": 4, \\\"manucci\\\": 1, \\\"europe\\\": 17, \\\"settled\\\": 3, \\\"down\\\": 48, \\\"philosopher\\\": 4, \\\"1656\\\": 1, \\\"1668\\\": 2, \\\"closely\\\": 3, \\\"associated\\\": 11, \\\"physician\\\": 3, \\\"prince\\\": 1, \\\"dara\\\": 1, \\\"shukoh\\\": 1, \\\"eldest\\\": 3, \\\"emperor\\\": 4, \\\"shah\\\": 1, \\\"jahan\\\": 1, \\\"intellectual\\\": 5, \\\"scientist\\\": 1, \\\"danishmand\\\": 1, \\\"khan\\\": 1, \\\"armenian\\\": 1, \\\"noble\\\": 15, \\\"comparing\\\": 4, \\\"\\\\u201ceast\\\\u201d\\\": 1, \\\"\\\\u201cwest\\\\u201d\\\": 1, \\\"country\\\": 70, \\\"frequently\\\": 9, \\\"situation\\\": 14, \\\"dedicated\\\": 4, \\\"major\\\": 1, \\\"louis\\\": 2, \\\"king\\\": 12, \\\"france\\\": 10, \\\"form\\\": 35, \\\"influential\\\": 1, \\\"officials\\\": 1, \\\"ministers\\\": 3, \\\"virtually\\\": 1, \\\"every\\\": 127, \\\"bleak\\\": 6, \\\"accurate\\\": 3, \\\"published\\\": 3, \\\"bernier\\\\u2019s\\\": 10, \\\"123\\\": 2, \\\"army\\\": 2, \\\"army\\\\u2019s\\\": 1, \\\"march\\\": 5, \\\"kashmir\\\": 1, \\\"am\\\": 133, \\\"keep\\\": 12, \\\"good\\\": 39, \\\"turkoman\\\": 1, \\\"horses\\\": 6, \\\"powerful\\\": 9, \\\"camel\\\": 1, \\\"driver\\\": 1, \\\"groom\\\": 1, \\\"cook\\\": 4, \\\"servant\\\": 9, \\\"horse\\\": 6, \\\"flask\\\": 2, \\\"water\\\": 34, \\\"hand\\\": 36, \\\"custom\\\": 5, \\\"article\\\": 2, \\\"tent\\\": 1, \\\"moderate\\\": 5, \\\"size\\\": 3, \\\"portable\\\": 1, \\\"bed\\\": 17, \\\"strong\\\": 14, \\\"light\\\": 47, \\\"canes\\\": 1, \\\"pillow\\\": 3, \\\"mattress\\\": 1, \\\"round\\\": 20, \\\"leather\\\": 2, \\\"cloths\\\": 2, \\\"meals\\\": 1, \\\"napkins\\\": 1, \\\"dyed\\\": 1, \\\"cloth\\\": 2, \\\"bags\\\": 1, \\\"culinary\\\": 1, \\\"utensils\\\": 3, \\\"placed\\\": 30, \\\"large\\\": 19, \\\"bag\\\": 7, \\\"again\\\": 88, \\\"carried\\\": 13, \\\"capacious\\\": 2, \\\"double\\\": 4, \\\"sack\\\": 2, \\\"net\\\": 1, \\\"thongs\\\": 1, \\\"likewise\\\": 1, \\\"contains\\\": 2, \\\"provisions\\\": 3, \\\"linen\\\": 3, \\\"wearing\\\": 2, \\\"apparel\\\": 3, \\\"master\\\": 12, \\\"servants\\\": 7, \\\"care\\\": 26, \\\"lay\\\": 32, \\\"stock\\\": 4, \\\"excellent\\\": 16, \\\"rice\\\": 2, \\\"days\\\\u2019\\\": 2, \\\"consumption\\\": 3, \\\"sweet\\\": 24, \\\"biscuits\\\": 1, \\\"flavoured\\\": 1, \\\"anise\\\": 1, \\\"herb\\\": 3, \\\"limes\\\": 1, \\\"sugar\\\": 1, \\\"forgotten\\\": 5, \\\"iron\\\": 4, \\\"hook\\\": 2, \\\"purpose\\\": 22, \\\"suspending\\\": 1, \\\"draining\\\": 1, \\\"dahi\\\": 2, \\\"curds\\\": 1, \\\"refreshing\\\": 1, \\\"lemonade\\\": 1, \\\"1670\\\": 2, \\\"71\\\": 2, \\\"german\\\": 2, \\\"1725\\\": 1, \\\"reprinted\\\": 2, \\\"1684\\\": 1, \\\"marked\\\": 13, \\\"contrast\\\": 7, \\\"circulated\\\": 1, \\\"manuscripts\\\": 1, \\\"creation\\\": 22, \\\"circulation\\\": 3, \\\"produce\\\": 9, \\\"image\\\": 10, \\\"europeans\\\": 2, \\\"printing\\\": 1, \\\"1750\\\": 1, \\\"indians\\\": 2, \\\"itisamuddin\\\": 1, \\\"mirza\\\": 1, \\\"abu\\\": 2, \\\"talib\\\": 1, \\\"confronted\\\": 1, \\\"influence\\\": 6, \\\"producing\\\": 1, \\\"describe\\\": 16, \\\"list\\\": 5, \\\"journey\\\": 37, \\\"124\\\": 2, \\\"alien\\\": 1, \\\"overcoming\\\": 1, \\\"barriers\\\": 2, \\\"distinct\\\": 8, \\\"strategies\\\": 2, \\\"observed\\\": 23, \\\"aware\\\": 3, \\\"problems\\\": 3, \\\"inherent\\\": 1, \\\"task\\\": 20, \\\"himself\\\": 44, \\\"discussed\\\": 1, \\\"\\\\u201cbarriers\\\\u201d\\\": 1, \\\"obstructed\\\": 3, \\\"amongst\\\": 2, \\\"concepts\\\": 1, \\\"second\\\": 9, \\\"barrier\\\": 6, \\\"identified\\\": 1, \\\"absorption\\\": 1, \\\"consequent\\\": 1, \\\"insularity\\\": 1, \\\"constituted\\\": 1, \\\"third\\\": 6, \\\"depended\\\": 8, \\\"exclusively\\\": 1, \\\"brahmanas\\\": 3, \\\"citing\\\": 1, \\\"passages\\\": 2, \\\"vedas\\\": 1, \\\"puranas\\\": 1, \\\"bhagavad\\\": 1, \\\"gita\\\": 1, \\\"patanjali\\\": 1, \\\"manusmriti\\\": 1, \\\"explain\\\": 5, \\\"parallels\\\": 1, \\\"noted\\\": 6, \\\"recognised\\\": 3, \\\"knights\\\": 3, \\\"princes\\\": 1, \\\"monks\\\": 1, \\\"fire\\\": 29, \\\"lawyers\\\": 2, \\\"physicians\\\": 2, \\\"astronomers\\\": 1, \\\"scientists\\\": 1, \\\"artisans\\\": 6, \\\"words\\\": 58, \\\"attempted\\\": 10, \\\"suggest\\\": 3, \\\"divisions\\\": 1, \\\"unique\\\": 3, \\\"pointed\\\": 4, \\\"islam\\\": 1, \\\"equal\\\": 7, \\\"differing\\\": 2, \\\"observance\\\": 1, \\\"piety\\\": 2, \\\"spite\\\": 6, \\\"acceptance\\\": 2, \\\"brahmanical\\\": 1, \\\"disapproved\\\": 1, \\\"notion\\\": 2, \\\"pollution\\\": 2, \\\"remarked\\\": 3, \\\"everything\\\": 10, \\\"falls\\\": 1, \\\"impurity\\\": 1, \\\"strives\\\": 1, \\\"succeeds\\\": 1, \\\"regaining\\\": 1, \\\"original\\\": 7, \\\"condition\\\": 11, \\\"purity\\\": 1, \\\"sun\\\": 46, \\\"cleanses\\\": 1, \\\"air\\\": 37, \\\"salt\\\": 3, \\\"prevents\\\": 3, \\\"becoming\\\": 5, \\\"polluted\\\": 2, \\\"enormous\\\": 3, \\\"range\\\": 3, \\\"follows\\\": 2, \\\"conquer\\\": 2, \\\"e\\\": 27, \\\"because\\\": 29, \\\"inflections\\\": 1, \\\"something\\\": 22, \\\"calling\\\": 3, \\\"thing\\\": 17, \\\"various\\\": 31, \\\"derivative\\\": 4, \\\"order\\\": 13, \\\"properly\\\": 1, \\\"qualifying\\\": 1, \\\"epithets\\\": 2, \\\"god\\\": 24, \\\"knows\\\": 9, \\\"believe\\\": 35, \\\"told\\\": 20, \\\"faced\\\": 2, \\\"story\\\": 17, \\\"wooden\\\": 2, \\\"idol\\\": 3, \\\"supposedly\\\": 1, \\\"lasted\\\": 4, \\\"216\\\": 1, \\\"432\\\": 1, \\\"asks\\\": 2, \\\"wood\\\": 30, \\\"length\\\": 33, \\\"soil\\\": 3, \\\"wet\\\": 7, \\\"125\\\": 2, \\\"insisted\\\": 3, \\\"earth\\\": 40, \\\"impossible\\\": 10, \\\"intrinsic\\\": 1, \\\"contrary\\\": 6, \\\"varnas\\\": 2, \\\"highest\\\": 6, \\\"created\\\": 21, \\\"brahman\\\": 4, \\\"name\\\": 20, \\\"force\\\": 7, \\\"\\\\u2026\\\": 6, \\\"choice\\\": 5, \\\"whole\\\": 34, \\\"genus\\\": 1, \\\"therefore\\\": 41, \\\"consider\\\": 10, \\\"mankind\\\": 12, \\\"kshatriya\\\": 1, \\\"say\\\": 32, \\\"shoulders\\\": 3, \\\"degree\\\": 26, \\\"below\\\": 7, \\\"vaishya\\\": 1, \\\"thigh\\\": 1, \\\"shudra\\\": 1, \\\"feet\\\": 21, \\\"latter\\\": 15, \\\"great\\\": 78, \\\"differ\\\": 1, \\\"live\\\": 26, \\\"together\\\": 12, \\\"villages\\\": 2, \\\"mixed\\\": 1, \\\"houses\\\": 11, \\\"lodgings\\\": 2, \\\"deeply\\\": 21, \\\"influenced\\\": 4, \\\"normative\\\": 1, \\\"laid\\\": 3, \\\"rules\\\": 2, \\\"governing\\\": 2, \\\"point\\\": 18, \\\"real\\\": 8, \\\"rigid\\\": 1, \\\"defined\\\": 1, \\\"antyaja\\\": 1, \\\"literally\\\": 2, \\\"inexpensive\\\": 1, \\\"labour\\\": 18, \\\"subjected\\\": 1, \\\"oppression\\\": 4, \\\"networks\\\": 2, \\\"area\\\": 2, \\\"any\\\": 136, \\\"similarities\\\": 1, \\\"126\\\": 2, \\\"excitement\\\": 1, \\\"unfamiliar\\\": 3, \\\"global\\\": 1, \\\"network\\\": 2, \\\"communication\\\": 5, \\\"stretched\\\": 10, \\\"sacred\\\": 4, \\\"shrines\\\": 1, \\\"spending\\\": 1, \\\"officiating\\\": 1, \\\"enjoying\\\": 3, \\\"cosmopolitan\\\": 1, \\\"culture\\\": 1, \\\"centres\\\": 6, \\\"spoke\\\": 25, \\\"turkish\\\": 3, \\\"shared\\\": 4, \\\"anecdotes\\\": 1, \\\"cruel\\\": 4, \\\"ordinary\\\": 6, \\\"anything\\\": 11, \\\"highlighted\\\": 3, \\\"listener\\\": 2, \\\"suitably\\\": 1, \\\"examples\\\": 1, \\\"representation\\\": 2, \\\"evident\\\": 1, \\\"kinds\\\": 6, \\\"plant\\\": 1, \\\"completely\\\": 3, \\\"audience\\\": 1, \\\"betel\\\": 4, \\\"tree\\\": 9, \\\"cultivated\\\": 6, \\\"manner\\\": 35, \\\"grape\\\": 1, \\\"vine\\\": 1, \\\"fruit\\\": 2, \\\"grown\\\": 2, \\\"sake\\\": 9, \\\"eating\\\": 1, \\\"takes\\\": 6, \\\"areca\\\": 1, \\\"nut\\\": 3, \\\"nutmeg\\\": 1, \\\"broken\\\": 13, \\\"reduced\\\": 4, \\\"pellets\\\": 1, \\\"mouth\\\": 9, \\\"chews\\\": 1, \\\"puts\\\": 1, \\\"little\\\": 70, \\\"chalk\\\": 1, \\\"masticates\\\": 1, \\\"nuts\\\": 4, \\\"man\\\\u2019s\\\": 7, \\\"trees\\\": 23, \\\"peculiar\\\": 5, \\\"kind\\\": 38, \\\"astonishing\\\": 9, \\\"habit\\\": 5, \\\"exactly\\\": 6, \\\"date\\\": 8, \\\"palms\\\": 1, \\\"except\\\": 19, \\\"produces\\\": 3, \\\"fruits\\\": 2, \\\"dates\\\": 3, \\\"resembles\\\": 1, \\\"inside\\\": 6, \\\"green\\\": 8, \\\"looks\\\": 11, \\\"brain\\\": 4, \\\"attached\\\": 8, \\\"fibre\\\": 2, \\\"hair\\\": 9, \\\"cords\\\": 1, \\\"sew\\\": 1, \\\"ships\\\": 6, \\\"instead\\\": 11, \\\"nails\\\": 1, \\\"cables\\\": 1, \\\"vessels\\\": 5, \\\"comparisons\\\": 1, \\\"give\\\": 31, \\\"readers\\\": 1, \\\"coconuts\\\": 1, \\\"appropriate\\\": 1, \\\"convey\\\": 9, \\\"attracted\\\": 7, \\\"attention\\\": 25, \\\"add\\\": 5, \\\"127\\\": 2, \\\"found\\\": 97, \\\"full\\\": 35, \\\"drive\\\": 5, \\\"skills\\\": 1, \\\"densely\\\": 1, \\\"populated\\\": 3, \\\"prosperous\\\": 3, \\\"occasional\\\": 1, \\\"disruptions\\\": 1, \\\"caused\\\": 11, \\\"wars\\\": 2, \\\"invasions\\\": 1, \\\"appears\\\": 12, \\\"crowded\\\": 4, \\\"streets\\\": 12, \\\"bright\\\": 10, \\\"colourful\\\": 1, \\\"markets\\\": 3, \\\"stacked\\\": 1, \\\"goods\\\": 3, \\\"largest\\\": 2, \\\"maharashtra\\\": 1, \\\"less\\\": 18, \\\"rivalled\\\": 1, \\\"covers\\\": 2, \\\"rampart\\\": 4, \\\"parallel\\\": 1, \\\"breadth\\\": 1, \\\"wall\\\": 3, \\\"cubits\\\": 2, \\\"night\\\": 102, \\\"sentry\\\": 1, \\\"gatekeepers\\\": 1, \\\"ramparts\\\": 2, \\\"store\\\": 4, \\\"storing\\\": 1, \\\"edibles\\\": 1, \\\"magazines\\\": 1, \\\"ammunition\\\": 1, \\\"ballistas\\\": 1, \\\"siege\\\": 1, \\\"machines\\\": 2, \\\"grains\\\": 1, \\\"stored\\\": 2, \\\"rotting\\\": 1, \\\"interior\\\": 2, \\\"horsemen\\\": 1, \\\"infantrymen\\\": 1, \\\"move\\\": 10, \\\"pierced\\\": 2, \\\"windows\\\": 9, \\\"side\\\": 14, \\\"enters\\\": 2, \\\"built\\\": 5, \\\"stone\\\": 6, \\\"upper\\\": 2, \\\"towers\\\": 2, \\\"gates\\\": 7, \\\"darwaza\\\": 4, \\\"budaun\\\": 1, \\\"greatest\\\": 29, \\\"mandwi\\\": 1, \\\"grain\\\": 1, \\\"market\\\": 7, \\\"adjacent\\\": 2, \\\"gul\\\": 1, \\\"orchard\\\": 2, \\\"fine\\\": 12, \\\"cemetery\\\": 3, \\\"graves\\\": 3, \\\"domes\\\": 4, \\\"dome\\\": 2, \\\"arch\\\": 5, \\\"sure\\\": 6, \\\"sow\\\": 1, \\\"flowers\\\": 7, \\\"tuberose\\\": 1, \\\"jasmine\\\": 1, \\\"wild\\\": 15, \\\"rose\\\": 18, \\\"blossom\\\": 2, \\\"seasons\\\": 4, \\\"figs\\\": 1, \\\"top\\\": 6, \\\"tughlakabad\\\": 1, \\\"fortification\\\": 1, \\\"settlement\\\": 1, \\\"128\\\": 2, \\\"bazaars\\\": 4, \\\"transactions\\\": 2, \\\"hub\\\": 1, \\\"mosque\\\": 1, \\\"spaces\\\": 2, \\\"performances\\\": 3, \\\"dancers\\\": 1, \\\"musicians\\\": 3, \\\"singers\\\": 4, \\\"concerned\\\": 2, \\\"explaining\\\": 2, \\\"prosperity\\\": 4, \\\"significant\\\": 1, \\\"portion\\\": 11, \\\"wealth\\\": 9, \\\"appropriation\\\": 1, \\\"surplus\\\": 3, \\\"agriculture\\\": 3, \\\"productive\\\": 1, \\\"fertility\\\": 1, \\\"cultivate\\\": 1, \\\"crops\\\": 1, \\\"integrated\\\": 1, \\\"commerce\\\": 3, \\\"manufactures\\\": 4, \\\"demand\\\": 13, \\\"southeast\\\": 2, \\\"fetching\\\": 1, \\\"huge\\\": 6, \\\"profits\\\": 4, \\\"textiles\\\": 1, \\\"cotton\\\": 3, \\\"muslins\\\": 2, \\\"silks\\\": 2, \\\"brocade\\\": 2, \\\"satin\\\": 1, \\\"informs\\\": 3, \\\"certain\\\": 9, \\\"varieties\\\": 1, \\\"muslin\\\": 1, \\\"expensive\\\": 3, \\\"worn\\\": 4, \\\"nobles\\\": 5, \\\"music\\\": 8, \\\"tarababad\\\": 1, \\\"beautiful\\\": 31, \\\"numerous\\\": 6, \\\"shops\\\": 2, \\\"shop\\\": 2, \\\"door\\\": 29, \\\"leads\\\": 1, \\\"owner\\\": 7, \\\"decorated\\\": 2, \\\"carpets\\\": 2, \\\"swing\\\": 2, \\\"sits\\\": 1, \\\"singer\\\": 1, \\\"she\\\": 258, \\\"decked\\\": 1, \\\"finery\\\": 1, \\\"her\\\": 383, \\\"attendants\\\": 3, \\\"middle\\\": 6, \\\"stands\\\": 1, \\\"cupola\\\": 2, \\\"carpeted\\\": 2, \\\"dawn\\\": 5, \\\"prayers\\\": 3, \\\"accompanied\\\": 10, \\\"slaves\\\": 12, \\\"successive\\\": 2, \\\"crowds\\\": 3, \\\"sing\\\": 4, \\\"dance\\\": 2, \\\"dusk\\\": 3, \\\"withdraws\\\": 1, \\\"bazaar\\\": 1, \\\"mosques\\\": 1, \\\"offering\\\": 3, \\\"alighted\\\": 3, \\\"ikat\\\": 1, \\\"weaving\\\": 1, \\\"patterns\\\": 1, \\\"modified\\\": 3, \\\"coastal\\\": 1, \\\"production\\\": 9, \\\"129\\\": 2, \\\"evidently\\\": 4, \\\"special\\\": 3, \\\"routes\\\": 1, \\\"supplied\\\": 7, \\\"inns\\\": 2, \\\"amazed\\\": 2, \\\"efficiency\\\": 1, \\\"postal\\\": 5, \\\"send\\\": 5, \\\"remit\\\": 1, \\\"credit\\\": 7, \\\"distances\\\": 1, \\\"dispatch\\\": 1, \\\"efficient\\\": 1, \\\"reach\\\": 7, \\\"news\\\": 7, \\\"spies\\\": 2, \\\"foot\\\": 10, \\\"describes\\\": 2, \\\"horsepost\\\": 1, \\\"uluq\\\": 1, \\\"run\\\": 6, \\\"royal\\\": 4, \\\"stationed\\\": 1, \\\"post\\\": 7, \\\"stations\\\": 1, \\\"per\\\": 2, \\\"mile\\\": 5, \\\"dawa\\\": 2, \\\"wellpopulated\\\": 1, \\\"pavilions\\\": 1, \\\"sit\\\": 5, \\\"girded\\\": 1, \\\"loins\\\": 1, \\\"ready\\\": 5, \\\"start\\\": 5, \\\"carries\\\": 2, \\\"rod\\\": 3, \\\"copper\\\": 1, \\\"courier\\\": 2, \\\"starts\\\": 1, \\\"holds\\\": 2, \\\"letter\\\": 38, \\\"runs\\\": 2, \\\"fast\\\": 6, \\\"pavilion\\\": 1, \\\"hear\\\": 25, \\\"ringing\\\": 1, \\\"bell\\\": 1, \\\"get\\\": 10, \\\"soon\\\": 72, \\\"reaches\\\": 3, \\\"speed\\\": 8, \\\"shaking\\\": 2, \\\"till\\\": 7, \\\"destination\\\": 3, \\\"quicker\\\": 1, \\\"transport\\\": 3, \\\"khurasan\\\": 1, \\\"desired\\\": 26, \\\"describing\\\": 2, \\\"situations\\\": 5, \\\"experienced\\\": 12, \\\"strange\\\": 35, \\\"travelogue\\\": 1, \\\"mixture\\\": 5, \\\"emotions\\\": 9, \\\"appreciate\\\": 2, \\\"calicut\\\": 1, \\\"kozhikode\\\": 1, \\\"kerala\\\": 1, \\\"\\\\u201ca\\\": 8, \\\"likes\\\": 2, \\\"imagined\\\\u201d\\\": 1, \\\"nation\\\\u201d\\\": 1, \\\"mangalore\\\": 2, \\\"crossed\\\": 7, \\\"western\\\": 8, \\\"ghats\\\": 1, \\\"filled\\\": 25, \\\"admiration\\\": 15, \\\"leagues\\\": 4, \\\"square\\\": 1, \\\"approximately\\\": 1, \\\"yards\\\": 5, \\\"height\\\": 5, \\\"cast\\\": 13, \\\"bronze\\\": 1, \\\"porticos\\\": 1, \\\"entrance\\\": 2, \\\"portico\\\": 1, \\\"statue\\\": 1, \\\"likeness\\\": 1, \\\"stature\\\": 8, \\\"gold\\\": 7, \\\"rubies\\\": 2, \\\"cunningly\\\": 2, \\\"artisanship\\\": 1, \\\"operated\\\": 1, \\\"130\\\": 2, \\\"\\\\u201cdegenerate\\\\u201d\\\": 1, \\\"chose\\\": 3, \\\"excited\\\": 14, \\\"novelty\\\": 2, \\\"belonged\\\": 7, \\\"preoccupied\\\": 1, \\\"contrasting\\\": 1, \\\"depressing\\\": 1, \\\"seems\\\": 7, \\\"makers\\\": 2, \\\"intelligentsia\\\": 1, \\\"\\\\u201cright\\\\u201d\\\": 1, \\\"decisions\\\": 1, \\\"insights\\\": 1, \\\"reflection\\\": 14, \\\"discussions\\\": 1, \\\"trying\\\": 1, \\\"mughals\\\": 2, \\\"universal\\\": 3, \\\"constantly\\\": 3, \\\"emphasising\\\": 1, \\\"superiority\\\": 1, \\\"model\\\": 3, \\\"binary\\\": 2, \\\"opposition\\\": 2, \\\"presented\\\": 16, \\\"inverse\\\": 1, \\\"perceived\\\": 27, \\\"hierarchically\\\": 1, \\\"appeared\\\": 60, \\\"inferior\\\": 3, \\\"landownership\\\": 2, \\\"fundamental\\\": 1, \\\"lack\\\": 1, \\\"private\\\": 7, \\\"property\\\": 12, \\\"former\\\": 16, \\\"firm\\\": 8, \\\"believer\\\": 1, \\\"virtues\\\": 9, \\\"crown\\\": 6, \\\"ownership\\\": 3, \\\"harmful\\\": 1, \\\"thought\\\": 82, \\\"owned\\\": 2, \\\"distributed\\\": 6, \\\"disastrous\\\": 2, \\\"consequences\\\": 5, \\\"economy\\\": 1, \\\"perception\\\": 1, \\\"travellers\\\\u2019\\\": 2, \\\"owing\\\": 2, \\\"landholders\\\": 1, 